//: [Previous](@previous)

/*

Q. BinaryGap - Find longest sequence of zeros in binary representation of an integer.
 
그러니까,
숫자 9는 2 진 표현 1001을 가지며 가운데 2칸짜리 0 2개있어.
숫자 529는 2 진 표현 1000010001을 가지며 4칸짜리 0하고 3칸짜리 0 2개있어.
숫자 20은 2 진 표현 10100을 가지며 1칸짜리, 2칸짜리해서 2개있어.
숫자 15는 2 진 표현 1111을 가지며 0 없어.
숫자 32는 이진 표현 100000을 가지며 5칸짜리 1개 있어.
 
함수를 작성하십시오.
클래스 솔루션 {public int solution (int N); }

예를 들어, N = 1041이 주어지면 함수는 5를 리턴해야합니다. N은 2 진 표현 10000010001을 가지므로 가장 긴 2 진
간격은 길이 5입니다. N = 32 일 때 함수 N은 2 진 표현 '100000'을 가지므로 0을 반환해야합니다. 바이너리 갭이 없
다. 그니까 0이 몇칸있는 것을 출력하는 게 아니라, 1하고 1사이에 0이 있는 것들 중에 제일 긴 것을 반환해라는 거야.
*/





//: [Next](@next)
