//: [Previous](@previous)
/*
OddOccurrencesInArray - Find value that occurs in odd number of elements.

 N 개의 정수로 구성된 비어 있지 않은 배열 A가 주어진다. 배열에는 홀수 개의 요소가 포함되어 있으며 배열의 각 요소는 동일한 값을 가진 다른 요소와 쌍을 이룰 수 있습니다 (단 하나의 요소는 쌍을 이루지 않음).
 
 예를 들어 다음과 같은 배열 A에서 :
 
     A [0] = 9 A [1] = 3 A [2] = 9
     A [3] = 3 A [4] = 9 A [5] = 7
     A [6] = 9
 인덱스 0과 2의 요소는 값 9를 가지고,
 인덱스 1과 3의 요소는 값 3을 가지고,
 인덱스 4와 6의 요소는 값 9를 가지며,
 인덱스 5의 요소는 값 7을 가지며 대응되지 않습니다.
 함수를 작성하십시오.
 
 클래스 솔루션 {public int solution (int [] A); }
 
 위의 조건을 충족하는 N 개의 정수로 구성된 배열 A가 주어지면, 비 대응 요소의 값을 반환합니다.
 
 예를 들어, 주어진 배열 A는 다음과 같습니다.
 
     A [0] = 9 A [1] = 3 A [2] = 9
     A [3] = 3 A [4] = 9 A [5] = 7
     A [6] = 9
 함수는 위의 예제에서 설명한 것처럼 7을 반환해야합니다.

 
*/

//: [Next](@next)
