//: Playground - noun: a place where people can play

/*
하샤드 수 구하기
하샤드 수 : 자연수 N의 각 자릿수 숫자의 합을 구한 뒤, 그 합한 숫자로 자기 자신이 나누어 떨어지는 수 ex) 18의 자릿
수 합은 1 + 8 = 9이고, 18은 9로 나누어 떨어지므로 하샤드 수.
 
 하샤드 수 또는 니번 수는 주어진 진법에서 그 수의 각 자릿수 숫자의 합으로 그 수가 나누어지는 양의 정수를 말한다. 하샤드 수는 인도의 수학자 카프레카에 의해 정의되었다. 산스크리트어 하샤(harsa)로부터 유래한 "하샤드"(Harshad)라는 단어는 "큰 기쁨"이라는 의미이다. 니번 수는 이반 니번이 1997년 수론에 관한 회의에 제출한 논문에서, 자신의 이름에서 유래하였다. 0과 진법의 밑 사이의 모든 정수는 하샤드 수이다.
 
 10진법에서 한 자릿수보다 큰, 첫 50개의 하샤드 수는 다음과 같다. (OEIS의 수열 A005349):
 
 10, 12, 18, 20, 21, 24, 27, 30, 36, 40, 42, 45, 48, 50, 54, 60, 63, 70, 72, 80, 81, 84, 90, 100, 102, 108, 110, 111, 112, 114, 117, 120, 126, 132, 133, 135, 140, 144, 150, 152, 153, 156, 162, 171, 180, 190, 192, 195, 198, 200
 어느 진법에서도 (즉, 어느 밑에서도) 그 수가 하샤드 수인 수를 all-Harshad number 또는 all-Niven number라 한다. 그리고 그 수는 단지 4개뿐이다. : 1, 2, 4, 6.
 
*/

